# Pandas

Pandas es una herramienta de manipulación de datos de alto, está construido sobre Numpy, y su estructura de datos clave se denomina DataFrame. Un DataFrame permite almacenar y manipular datos tabulados en filas de observaciones, y columnas de variables.

El nombre deriva del término "datos de panel", término de econometría que designa datos que combinan una dimensión temporal con otra dimensión transversal.

## 0. Librerías

In [1]:
# Tratamientos datos
# -----------------------------------------------------------------------------
import pandas as pd
import numpy as np

## 1. Tipos de objeto

### 1.1. Tipos de dato

En Pandas podemos trabajar con los siguientes tipos de datos:

- bool
- object (string)
- category
- int (int8, int16, ...)
- float (float16, float32, ...)
- datetime64

In [ ]:
# Enteros
np.iinfo('int8')
np.iinfo('int16')
np.iinfo('int32')
np.iinfo('int64')

In [40]:
np.iinfo('int16')

iinfo(min=-32768, max=32767, dtype=int16)

In [ ]:
# Decimales
np.finfo('float16')
np.finfo('float32')
np.finfo('float64')

In [41]:
np.finfo('float16')

finfo(resolution=0.001, min=-6.55040e+04, max=6.55040e+04, dtype=float16)

### 1.2. Tipos de objeto en Pandas

En pandas existen tres tipos básicos de objetos todos ellos basados a su vez en Numpy:

- Series: listas, 1D
- DataFrame: tablas tabuladas, 2D
- Panels: tablas 3D

In [16]:
# Serie
s1 = pd.Series([1, 2, 3, 5, 20, 22, 22, 25, 100])
s1

0      1
1      2
2      3
3      5
4     20
5     22
6     22
7     25
8    100
dtype: int64

In [17]:
s1.index, s1.values

(RangeIndex(start=0, stop=9, step=1),
 array([  1,   2,   3,   5,  20,  22,  22,  25, 100]))

In [19]:
# DataFrame
dfdata = {'province': ['M', 'M', 'M', 'B', 'B'],
          'population': [1.5e6, 2e6, 3e6, 5e5, 1.5e6],
          'year': [1900, 1950, 2000, 1900, 2000]}

df = pd.DataFrame(dfdata)
df

  province  population  year
0        M   1500000.0  1900
1        M   2000000.0  1950
2        M   3000000.0  2000
3        B    500000.0  1900
4        B   1500000.0  2000

## 2. Cargar datos en Pandas

### 2.1. Mediante un diccionaro o lista de listas

In [20]:
# Definimos un diccionario:
dictionary = {
    'id': [1, 2, 3],
    'name': ['Bob', 'Sally', 'Scott'],
    'occupation': ['Builder', 'Baker', 'Candle Stick Maker']
}

# Utilizamos la función pd.DataFrame():
df = pd.DataFrame(dictionary)
df

   id   name          occupation
0   1    Bob             Builder
1   2  Sally               Baker
2   3  Scott  Candle Stick Maker

In [24]:
# Definimos una lista de listas:
lista = [
    [1, 'Bob', 'Builder'],
    [2, 'Sally', 'Baker'],
    [3, 'Scott', 'Candle Stick Maker']
]

# Utilizamos la función pd.DataFrame():
df = pd.DataFrame(lista, columns=['id', 'name', 'occupation'])
df

   id   name          occupation
0   1    Bob             Builder
1   2  Sally               Baker
2   3  Scott  Candle Stick Maker

### 2.2. Importar y exportar ficheros

In [28]:
# Importar un .csv a un DataFrame
df = pd.read_csv('./data/imdb_movie_data.csv', sep=",") 
df.head()

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
0,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [ ]:
# Exportar un DataFrame a .csv
df.to_csv ('data/my-data.csv', index=False, header=True)

### 2.3. Hacer una copia de un DataFrame

In [ ]:
df_copy = df.copy(deep = True)

## 3. Análisis exploratorio de datos

### 3.1. Muestras y dimensiones del dato

In [ ]:
df.head()       # Primeras 5 filas
df.tail()       # Últimas 5 filas
df.sample(5)    # Muestra aleatoria de 5 filas
df.columns      # Columnas del DataFrame
df.shape        # Tupla (filas, columnas)
df.describe()   # Medidas de tendencia central y dispersión
df.dtype()      # Tipo de datos
df.info()       # Tipo de datos y memoria

### 3.2. Estadísticos

In [ ]:
df.describe()   # Resumen de estadísticos para las columnas de tipo variable continua
df.describe(include = "all").round(2)
df.mean()       # Media de todas las columnas
df.corr()       # Matriz de correlación de las variables de tipo continuas
df.count()      # Valores no-nulos de cada columna
df.max()        # Valor máximo de cada columna
df.min()        # Valor mínimo de cada columna
df.median()     # Mediana de cada columna
df.std()        # Desviación estándar de cad acolumna

### 3.3. Valores únicos y NaN

In [ ]:
df['Year'].unique()        # Valores posibles de una columna
df['Year'].nunique()       # Conteo de los valores posibles de una columna
df['Year'].isnull().sum()  # Conteo de nulos en una columna
df['Year'].fillna(0)       # Poblar los NaN de una columna con 0

## 3. Manipulación de columnas

In [3]:
df.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

### 3.1. Seleccionar columnas

In [ ]:
df[['Title','Rating']]

In [ ]:
df.filter(['Title','Rating'])

### 3.2. Renombrar

In [ ]:
df.rename(columns={'Title': 'Title_renamed', 'Rating': 'Rating_renamed'}, inplace=True)

### 3.3. Nueva columna

In [ ]:
# Valor fijo
df['new_column'] = 23

In [ ]:
# Operaciones aritméticas
df['Rating_Votes'] = df.Rating + df.Votes

In [ ]:
# Mapeo de valores mediante diccionario
diccionario = {
    'Drama,Romance': 'Drama',
    'Comedy,Drama,Music': 'Drama',
    'Adventure,Drama,Horror': 'Drama'
}

df['Genre_2'] = df['Genre'].map(diccionario)

In [ ]:
# Función sobre una columna:
def drama_function(row):
    if row['Genre'] == 'Drama,Romance':
        return 'Drama'
    elif row['Genre'] == 'Comedy,Drama,Music':
        return 'Drama'
    else:
        return row

df['Genre_2'] = df['Genre'].apply(drama_function)

In [ ]:
# Función select de NumPy:
conditions = [
    df['Genre'] == 'Drama,Romance',
    df['Genre'] == 'Comedy,Drama,Music',
    df['Genre'] == 'Adventure,Drama,Horror',
]

choices = ['Drama', 'Drama', 'Drama']

df['Genre'] = np.select(conditions, choices, default=df['Genre'])

### 3.4. Castear tipo de dato

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Title               1000 non-null   object
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(3), object(5)
memory usage: 86.1+ KB

In [ ]:
# Castear de int a string
df['Year_str'] = df['Year'].astype(str)

In [ ]:
# Castear de string a int
df['Year_int'] = df['Year_str'].astype(int)

In [ ]:
# Castear de float a int
df['Rating_int'] = df['Rating'].round(0).astype(int)

In [ ]:
# Hacer downcast de campos tipo int y float
icols = df.select_dtypes('integer').columns
fcols = df.select_dtypes('float').columns

df[icols] = df[icols].apply(pd.to_numeric, downcast='integer')
df[fcols] = df[fcols].apply(pd.to_numeric, downcast='float')

### 3.5. Columnas de tipo String

In [ ]:
# Replace
df['Title'].replace('Prometheus', 'Alien') 
df[df.Title == 'Prometheus']

In [ ]:
# Minúsculas
df['Title2'] = df['Title'].str.lower()
df[['Title2','Title']].head()

In [ ]:
# Mayúsculas
df['Title2'] = df['Title'].str.upper() 
df[['Title2','Title']].head()

In [ ]:
# Longitud
df['Title2'] = df['Title'].str.len() 
df[['Title2','Title']].head()

In [ ]:
# Primera letras
df['Title2'] = df['Title'].str.split(' ').str[0]
df[['Title2','Title']].head()

In [ ]:
# Encontrar "Squad" en el título
df['Title2'] = df['Title'].str.find('Squad', 0) 
df[['Title2','Title']].head()

### 3.6. Columnas de tipo Date

In [ ]:
pd.to_datetime('2010/11/12')

### 3.7. Ordenar

In [ ]:
df.sort_values(by='Title', ascending=True, inplace=True)

In [ ]:
df.sort_values(by=['Director','Year'], ascending=[True,False], inplace=True)

## 4. Manipulación de filas

### 4.1. Eliminar duplicados

In [ ]:
df.drop_duplicates(keep='first', inplace=True)

### 4.1. Filtro

In [ ]:
# Título Prometheus
df[df.Title == 'Prometheus']

In [ ]:
# Rating mayor o igual que 8.5
df[df.Rating >= 8.5]

In [ ]:
# Año 2016 o 2017
df[(df.Year == 2016) | (df.Year == 2017)]

In [ ]:
# Año 2016 y Rating mayor o igual que 8.5
df[(df.Year == 2016) & (df.Rating >= 8.5)]

In [ ]:
# Título igual a 'Prometheus', 'Sing' o 'Guardians of the Galaxy'
title = ['Prometheus', 'Sing', 'Guardians of the Galaxy']
df[df.Title.isin(title)]

In [ ]:
# Año igual a 2010, 2015 o 2002
years = [2010, 2015, 2002]
df[df.Year.isin(years)]

#### 4.1.1. loc e iloc

In [ ]:
# 3 primeras filas
df.iloc[0:3]

In [ ]:
# 4 primeras filas y dos primeras columnas
df.iloc[0:4, 0:2]

In [35]:
s = pd.Series(list("abcdef"), index=[49, 48, 47, 0, 1, 2])
s

49    a
48    b
47    c
0     d
1     e
2     f
dtype: object

In [36]:
s.loc[0]

'd'

In [37]:
s.iloc[0]

'a'

In [38]:
s.loc[0:1]

0    d
1    e
dtype: object

In [39]:
s.iloc[0:1]

49    a
dtype: object

## 5. Manipulación de tablas

### 5.1. Group By

In [ ]:
# Número de títulos por año 
df.groupby("Year")["Title"].count().to_frame()

In [ ]:
# Número de títulos por año y por director
df.groupby(["Year","Director"])["Title"].count().to_frame().reset_index()

In [ ]:
# Número de títulos por director
df.groupby(["Director"])["Title"].count().to_frame(name = 'count').reset_index()

In [ ]:
# Total de ingresos por año y por director
df.groupby(["Year","Director"])["Revenue (Millions)"].sum().to_frame().reset_index()

In [ ]:
# rating medio por director
df.groupby("Director")["Rating"].mean().to_frame().reset_index()

In [ ]:
# Diferentes agregaciones
df.groupby(["Year","Director"]).agg(
    {
        'Title': "count",
        'Rating': "mean",
        'Revenue (Millions)': "sum"
    }
).reset_index()

### 5.2. Join

In [30]:
# Nuevo dataframe "df_dir_movies"
df_dir_movies = df.groupby(["Director"]).agg({'Title': "count"}).reset_index() 
df_dir_movies.head()

              Director  Title
0           Aamir Khan      1
1  Abdellatif Kechiche      1
2            Adam Leon      1
3           Adam McKay      4
4        Adam Shankman      2

In [31]:
# Nuevo dataframe "df_dir_rev"
df_dir_rev = df.groupby(["Director"]).agg({"Revenue (Millions)": "sum"}).reset_index() 
df_dir_rev.head()

              Director  Revenue (Millions)
0           Aamir Khan                1.20
1  Abdellatif Kechiche                2.20
2            Adam Leon                0.00
3           Adam McKay              438.14
4        Adam Shankman              157.33

In [32]:
# Join
pd.merge(
    df_dir_movies,
    df_dir_rev,
    left_on=['Director'],
    right_on=['Director'],
    how = 'left'
).head()

              Director  Title  Revenue (Millions)
0           Aamir Khan      1                1.20
1  Abdellatif Kechiche      1                2.20
2            Adam Leon      1                0.00
3           Adam McKay      4              438.14
4        Adam Shankman      2              157.33

### 5.3. Concatenar

In [ ]:
# Concatenar el df2 a df
df2 = df
df.append(df2)

In [ ]:
# Concatenar el df2 a df
pd.concat([df, df2], axis=0)